Res-firecracker-random-in2-v8/firecracker_t_4_c_6_frontVcpu_6_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5112.951ms, rate sampling interval: 17907ms
  Thread calibration: mean lat.: 5110.237ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 4926.777ms, rate sampling interval: 16285ms
  Thread calibration: mean lat.: 4939.470ms, rate sampling interval: 16465ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    21.96s    14.89s   50.95s    77.07%
    Req/Sec   272.50      1.75   276.00     80.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.11s 
 75.000%   35.09s 
 90.000%   47.87s 
 99.000%   50.95s 
 99.900%    0.86m 
 99.990%    0.86m 
 99.999%    0.86m 
100.000%    0.86m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7573.503     0.000000            1         1.00
    9076.735     0.100000         5539         1.11
    9715.711     0.200000        11036         1.25
   10403.839     0.300000        16443         1.43
   11165.695     0.400000        21915         1.67
   12107.775     0.500000        27414         2.00
   15056.895     0.550000        30134         2.22
   20135.935     0.600000        32873         2.50
   25182.207     0.650000        35615         2.86
   30113.791     0.700000        38353         3.33
   35094.527     0.750000        41090         4.00
   37224.447     0.775000        42458         4.44
   39780.351     0.800000        43848         5.00
   42106.879     0.825000        45205         5.71
   44498.943     0.850000        46567         6.67
   46694.399     0.875000        47948         8.00
   47316.991     0.887500        48654         8.89
   47874.047     0.900000        49307        10.00
   48267.263     0.912500        49991        11.43
   48594.943     0.925000        50696        13.33
   48988.159     0.937500        51411        16.00
   49184.767     0.943750        51755        17.78
   49381.375     0.950000        52059        20.00
   49577.983     0.956250        52405        22.86
   49840.127     0.962500        52754        26.67
   50069.503     0.968750        53106        32.00
   50167.807     0.971875        53260        35.56
   50298.879     0.975000        53443        40.00
   50397.183     0.978125        53599        45.71
   50561.023     0.981250        53792        53.33
   50659.327     0.984375        53928        64.00
   50724.863     0.985938        54024        71.11
   50823.167     0.987500        54130        80.00
   50888.703     0.989062        54193        91.43
   50987.007     0.990625        54307       106.67
   51052.543     0.992188        54380       128.00
   51085.311     0.992969        54404       142.22
   51118.079     0.993750        54448       160.00
   51183.615     0.994531        54503       182.86
   51216.383     0.995313        54530       213.33
   51281.919     0.996094        54582       256.00
   51314.687     0.996484        54596       284.44
   51347.455     0.996875        54620       320.00
   51380.223     0.997266        54635       365.71
   51445.759     0.997656        54675       426.67
   51478.527     0.998047        54689       512.00
   51478.527     0.998242        54689       568.89
   51511.295     0.998437        54708       640.00
   51544.063     0.998633        54722       731.43
   51544.063     0.998828        54722       853.33
   51576.831     0.999023        54733      1024.00
   51609.599     0.999121        54746      1137.78
   51609.599     0.999219        54746      1280.00
   51609.599     0.999316        54746      1462.86
   51642.367     0.999414        54755      1706.67
   51675.135     0.999512        54766      2048.00
   51675.135     0.999561        54766      2275.56
   51675.135     0.999609        54766      2560.00
   51675.135     0.999658        54766      2925.71
   51707.903     0.999707        54774      3413.33
   51707.903     0.999756        54774      4096.00
   51707.903     0.999780        54774      4551.11
   51707.903     0.999805        54774      5120.00
   51707.903     0.999829        54774      5851.43
   51740.671     0.999854        54783      6826.67
   51740.671     1.000000        54783          inf
#[Mean    =    21964.030, StdDeviation   =    14888.735]
#[Max     =    51707.904, Total count    =        54783]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  64995 requests in 1.00m, 26.80MB read
Requests/sec:   1083.27
Transfer/sec:    457.45KB